# RemovedSomeFaces Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BRepBuilder..::..RemovedSomeFaces Method
BRepBuilder Class See Also
---
Returns 'true' if BRepBuilder removed some problematic faces from the output geometry, 'false' if not. If allowRemovalOfProblematicFaces was not called to enable removal of problematic faces, this function will return 'false'. Note that if some faces were removed, the output geometry's type will be OpenShell regardless of the expected type that was specified when the BRepBuilder was created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017_subscription_update
# Syntax
C#
---
```text
public bool RemovedSomeFaces()
```

Visual Basic
---
```text
Public Function RemovedSomeFaces As Boolean
```

Visual C++
---
```text
public:
bool RemovedSomeFaces()
```

# ### Return Value
True if BRepBuilder removed some faces, false if not.
# See Also
BRepBuilder Class
Autodesk.Revit.DB Namespace